app/controllers/examples_controller.rb

  def new
    @example_notes = Example.pluck(:notes)
---
SELECT "examples"."notes" FROM "examples"