app/controllers/examples_controller.rb

SELECT "examples".* FROM "examples"
---
  def index
    @list = Example.all

SELECT  "examples".* FROM "examples" WHERE "examples"."id" = $1 LIMIT 1  [["id", 7]]
---
  def show
    @example = Example.find(params.fetch(:id).to_i)

SELECT "examples".* FROM "examples"
---
  def new
    @examples = Example.all

INSERT INTO "examples" ("notes", "key") VALUES ($1, $2) RETURNING "id"  [["notes", "[0, -12, -12, -15, -15, -15, nil, 0]"], ["key", 60]]
---
  def create
    length = params.fetch(:length).to_i
    key = params.fetch(:key).to_i
    examples = Formatter.format_examples(params.fetch(:examples))
    phrase = Phrase.new(length: length, examples: examples)
    Example.create(notes: phrase.notes, tonic: key).save

DELETE FROM "examples" WHERE "examples"."id" = $1  [["id", 22]]
SELECT  "examples".* FROM "examples" WHERE "examples"."id" = $1 LIMIT 1  [["id", 22]]
---
  def destroy
    id = params.fetch(:id).to_i
    Example.find(id).destroy